{
  "products": [
    {
      "id": "1",
      "name": "2x4 Timber",
      "image": "https://via.placeholder.com/300x300?text=2x4+Timber",
      "price": 5.25,
      "description": "Standard 2x4 lumber for framing and general construction. This versatile softwood lumber is perfect for building walls, floors, and roofs. Made from high-quality pine, it's kiln-dried to reduce warping and splitting. Ideal for both indoor and outdoor projects when properly treated. Meets all building code requirements for structural applications.",
      "quantity": 100,
      "category": "timber"
    },
    {
      "id": "2",
      "name": "2x6 Timber",
      "image": "https://via.placeholder.com/300x300?text=2x6+Timber",
      "price": 6.75,
      "description": "Durable 2x6 lumber for construction and decking applications. This premium grade lumber offers excellent strength-to-weight ratio, making it perfect for floor joists, ceiling beams, and deck framing. The larger dimension provides superior load-bearing capacity compared to 2x4s. Pre-treated options available for outdoor use.",
      "quantity": 60,
      "category": "timber"
    },
    {
      "id": "3",
      "name": "2x8 Timber",
      "image": "https://via.placeholder.com/300x300?text=2x8+Timber",
      "price": 8,
      "description": "Strong 2x8 lumber ideal for floor joists and structural beams. This heavy-duty lumber can span longer distances without additional support, making it perfect for large rooms and open floor plans. Excellent for load-bearing applications including headers, beams, and rafters. Kiln-dried for dimensional stability.",
      "quantity": 50,
      "category": "timber"
    },
    {
      "id": "4",
      "name": "2x10 Timber",
      "image": "https://via.placeholder.com/300x300?text=2x10+Timber",
      "price": 9.5,
      "description": "Premium 2x10 lumber used in wide framing applications and heavy-duty construction. Perfect for floor joists in larger spans, providing exceptional strength and minimal deflection. Commonly used in commercial construction and large residential projects. This grade lumber ensures long-lasting performance in demanding structural situations.",
      "quantity": 30,
      "category": "timber"
    },
    {
      "id": "5",
      "name": "Sheathing Plywood",
      "image": "https://via.placeholder.com/300x300?text=Sheathing+Plywood",
      "price": 28.99,
      "description": "High-quality 4x8 foot sheathing plywood, engineered for roofing and wall applications. This structural grade plywood provides excellent strength and weather resistance when used as subflooring, roof decking, or wall sheathing. Made with moisture-resistant adhesives and featuring smooth surface for easy installation.",
      "quantity": 40,
      "category": "timber"
    },
    {
      "id": "6",
      "name": "Hardwood Plywood",
      "image": "https://via.placeholder.com/300x300?text=Hardwood+Plywood",
      "price": 45.5,
      "description": "Premium hardwood plywood featuring beautiful wood grain patterns and superior durability. Perfect for cabinet making, furniture construction, and high-end interior projects. This furniture-grade plywood offers excellent screw holding power and smooth finishing surface. Available in various species including oak, maple, and birch.",
      "quantity": 25,
      "category": "timber"
    },
    {
      "id": "7",
      "name": "Interior Paint",
      "image": "https://via.placeholder.com/300x300?text=Interior+Paint",
      "price": 35.99,
      "description": "Premium latex interior paint with excellent coverage and durability. This one-gallon container provides rich, even color with superior hide and washability. Low-odor formula dries quickly to a smooth, professional finish. Available in flat, satin, and semi-gloss sheens for various room applications.",
      "quantity": 55,
      "category": "paint and stain"
    },
    {
      "id": "8",
      "name": "Exterior Stain",
      "image": "https://via.placeholder.com/300x300?text=Exterior+Stain",
      "price": 29.99,
      "description": "High-quality exterior wood stain designed to protect and enhance the natural beauty of wood surfaces. This one-gallon container provides excellent UV protection and water resistance. Perfect for decks, fences, and outdoor furniture. Available in a variety of colors to suit your project.",
      "quantity": 40,
      "category": "paint and stain"
    },
    {
      "id": "9",
      "name": "Grass Seed",
      "image": "https://via.placeholder.com/300x300?text=Grass+Seed",
      "price": 45.99,
      "description": "Premium grass seed blend for establishing thick, durable lawns in sun and partial shade conditions. This 20-pound bag covers up to 8,000 square feet with drought-resistant varieties. Quick germination in 7-14 days with proper watering and soil preparation. Perfect for new lawns, overseeding, and bare spot repair.",
      "quantity": 35,
      "category": "seeds"
    },
    {
      "id": "10",
      "name": "Nails (100pcs)",
      "image": "https://via.placeholder.com/300x300?text=Hand+Tools",
      "price": 5.99,
      "description": "Complete set of 100 high-quality steel nails suitable for a variety of construction and woodworking projects. These durable nails are designed for strong holding power and resistance to bending. Ideal for framing, carpentry, and general repairs. Compatible with most hammers and nail guns for easy application. Perfect for both indoor and outdoor use.",
      "quantity": 50,
      "category": "wood working tools"
    },
    {
      "id": "11",
      "name": "Power Drill",
      "image": "https://via.placeholder.com/300x300?text=Power+Drill",
      "price": 79.99,
      "description": "Cordless power drill with variable speed trigger and keyless chuck for versatile drilling and driving applications. Includes rechargeable battery, charger, and basic drill bit set. Compact design with LED work light for improved visibility in dark spaces. Perfect for furniture assembly, picture hanging, and general home repairs.",
      "quantity": 30,
      "category": "wood working tools"
    },
    {
      "id": "12",
      "name": "Caulk",
      "image": "https://via.placeholder.com/300x300?text=Caulk",
      "price": 3.99,
      "description": "Flexible acrylic caulk perfect for sealing gaps around windows, doors, and trim. This paintable caulk adheres to most surfaces and remains flexible after curing. Easy to apply with standard caulk gun and tools off cleanly with soap and water. Excellent for both interior and exterior weatherproofing applications.",
      "quantity": 180,
      "category": "paint and stain"
    },
    {
      "id": "13",
      "name": "Weatherstripping",
      "image": "https://via.placeholder.com/300x300?text=Weatherstripping",
      "price": 8.25,
      "description": "Self-adhesive foam weatherstripping for doors and windows energy efficiency. This 17-foot roll provides excellent seal against air leaks and drafts. Easy installation requires no tools or fasteners. Helps reduce heating and cooling costs while improving indoor comfort levels throughout the year.",
      "quantity": 90,
      "category": "paint and stain"
    },
    {
      "id": "14",
      "name": "Door Hinges",
      "image": "https://via.placeholder.com/300x300?text=Door+Hinges",
      "price": 12.49,
      "description": "Heavy-duty steel door hinges with removable pins for easy door installation and removal. These 3.5-inch hinges support doors up to 180 pounds with smooth, quiet operation. Rust-resistant finish suitable for interior and covered exterior applications. Includes mounting screws for standard door frame installation.",
      "quantity": 85,
      "category": "wood working tools"
    },
    {
      "id": "15",
      "name": "Door Handles",
      "image": "https://via.placeholder.com/300x300?text=Door+Handles",
      "price": 24.99,
      "description": "Stylish lever-style door handles with modern brushed nickel finish. These privacy locks feature easy-to-use thumb turn mechanism for bedroom and bathroom applications. Fits standard door preparations and includes all necessary mounting hardware. Smooth operation and contemporary design complement most home décor styles.",
      "quantity": 40,
      "category": "wood working tools"
    },
    {
      "id": "16",
      "name": "Window Locks",
      "image": "https://via.placeholder.com/300x300?text=Window+Locks",
      "price": 7.99,
      "description": "Adjustable window locks providing enhanced security for double-hung and sliding windows. These zinc-plated locks install easily with included screws and provide positive locking action. Suitable for wood, vinyl, and aluminum window frames. Helps prevent unauthorized entry while maintaining emergency egress capability.",
      "quantity": 110,
      "category": "wood working tools"
    },
    {
      "id": "17",
      "name": "Light Fixtures",
      "image": "https://via.placeholder.com/300x300?text=Light+Fixtures",
      "price": 49.99,
      "description": "Contemporary ceiling light fixture with brushed steel finish and frosted glass shade. This flush-mount fixture accommodates standard medium-base bulbs up to 60 watts. Easy installation with standard electrical box mounting. Provides excellent ambient lighting for bedrooms, hallways, and utility areas.",
      "quantity": 25,
      "category": "wood working tools"
    },
    {
      "id": "18",
      "name": "Electrical Outlets",
      "image": "https://via.placeholder.com/300x300?text=Electrical+Outlets",
      "price": 2.99,
      "description": "GFCI electrical outlets providing ground fault protection for bathroom, kitchen, and outdoor applications. These tamper-resistant outlets meet current electrical codes and safety standards. Easy installation in standard electrical boxes with clear test and reset button indicators. Essential for wet location electrical safety.",
      "quantity": 200,
      "category": "wood working tools"
    },
    {
      "id": "19",
      "name": "Light Switches",
      "image": "https://via.placeholder.com/300x300?text=Light+Switches",
      "price": 1.99,
      "description": "Standard single-pole light switches with quiet toggle action and durable construction. These 15-amp switches fit standard electrical boxes and work with most residential lighting circuits. White finish matches most wall plate styles and home décor. UL listed for safety and reliability in daily use.",
      "quantity": 250,
      "category": "wood working tools"
    },
    {
      "id": "20",
      "name": "Ceiling Fans",
      "image": "https://via.placeholder.com/300x300?text=Ceiling+Fans",
      "price": 89.99,
      "description": "Energy-efficient ceiling fan with reversible motor and remote control operation. This 52-inch fan features five wood-grain blades and integrated LED lighting. Quiet operation with multiple speed settings for year-round comfort. Easy installation with detailed instructions and all necessary mounting hardware included.",
      "quantity": 15,
      "category": "wood working tools"
    },
    {
      "id": "21",
      "name": "Smoke Detectors",
      "image": "https://via.placeholder.com/300x300?text=Smoke+Detectors",
      "price": 12.99,
      "description": "Battery-powered smoke detector with photoelectric sensor technology for reliable fire detection. Features low-battery warning chirp and test button for regular maintenance checks. Easy installation with mounting bracket and screws included. Ten-year lithium battery provides long-term protection without frequent battery changes.",
      "quantity": 80,
      "category": "wood working tools"
    },
    {
      "id": "22",
      "name": "Garden Hose",
      "image": "https://via.placeholder.com/300x300?text=Garden+Hose",
      "price": 24.99,
      "description": "Heavy-duty rubber garden hose designed for year-round outdoor use. This 50-foot hose features brass fittings and burst-resistant construction rated for high water pressure. Flexible in cold weather and kink-resistant design for easy handling. Perfect for lawn watering, car washing, and general outdoor cleaning tasks.",
      "quantity": 45,
      "category": "garden tools"
    },
    {
      "id": "23",
      "name": "Sprinkler System",
      "image": "https://via.placeholder.com/300x300?text=Sprinkler+System",
      "price": 79.99,
      "description": "Complete sprinkler system kit for automatic lawn and garden irrigation. Includes programmable timer, spray heads, and distribution tubing for up to 1000 square feet coverage. Water-efficient design reduces waste while maintaining healthy lawn and plants. Easy DIY installation with detailed setup instructions.",
      "quantity": 20,
      "category": "garden tools"
    },
    {
      "id": "24",
      "name": "Fertilizer",
      "image": "https://via.placeholder.com/300x300?text=Fertilizer",
      "price": 18.99,
      "description": "Balanced lawn fertilizer promoting healthy grass growth and rich green color. This 40-pound bag covers up to 15,000 square feet with slow-release formula feeding for up to 12 weeks. Contains essential nutrients including nitrogen, phosphorus, and potassium. Safe for children and pets when applied according to directions.",
      "quantity": 65,
      "category": "garden tools"
    },
    {
      "id": "25",
      "name": "Mulch",
      "image": "https://via.placeholder.com/300x300?text=Mulch",
      "price": 3.99,
      "description": "Natural hardwood mulch for landscaping and garden bed applications. This 2-cubic-foot bag provides excellent moisture retention and weed suppression around plants and trees. Naturally decomposes to enrich soil with organic matter. Rich brown color enhances curb appeal and complements most landscaping designs.",
      "quantity": 100,
      "category": "garden tools"
    },
    {
      "id": "26",
      "name": "Tomato Seeds",
      "image": "https://via.placeholder.com/300x300?text=Tomatoes",
      "price": 2.49,
      "description": "Premium heirloom tomato seeds perfect for home gardening enthusiasts. These non-GMO seeds produce flavorful, juicy tomatoes with exceptional taste and texture. Suitable for both container gardening and traditional garden beds. High germination rate with detailed planting instructions included. Harvest fresh, organic tomatoes all season long.",
      "quantity": 100,
      "category": "seeds"
    },
    {
      "id": "27",
      "name": "Onion Seeds",
      "image": "https://via.placeholder.com/300x300?text=Onions",
      "price": 2.29,
      "description": "Sweet onion seeds that are incredibly easy to grow in any garden setting. These varieties produce large, mild-flavored bulbs perfect for cooking and fresh eating. Long storage life when properly cured. Resistant to common onion diseases and adaptable to various soil conditions. Great for companion planting with tomatoes and peppers.",
      "quantity": 90,
      "category": "seeds"
    },
    {
      "id": "28",
      "name": "Mustard Greens Seeds",
      "image": "https://via.placeholder.com/300x300?text=Mustard+Greens",
      "price": 1.79,
      "description": "Zesty mustard greens seeds perfect for adding spicy flavor to salads and stir-fry dishes. These fast-growing leafy greens are packed with vitamins and nutrients. Can be harvested as baby greens or full-size leaves. Cold-hardy variety that extends your growing season. Excellent source of vitamins A, C, and K.",
      "quantity": 95,
      "category": "seeds"
    },
    {
      "id": "29",
      "name": "Fertilizer",
      "image": "https://via.placeholder.com/300x300?text=Fertilizer",
      "price": 18.99,
      "description": "Balanced lawn fertilizer promoting healthy grass growth and rich green color. This 40-pound bag covers up to 15,000 square feet with slow-release formula feeding for up to 12 weeks. Contains essential nutrients including nitrogen, phosphorus, and potassium. Safe for children and pets when applied according to directions.",
      "quantity": 65,
      "category": "garden tools"
    },
    {
      "id": "30",
      "name": "Mulch",
      "image": "https://via.placeholder.com/300x300?text=Mulch",
      "price": 3.99,
      "description": "Natural hardwood mulch for landscaping and garden bed applications. This 2-cubic-foot bag provides excellent moisture retention and weed suppression around plants and trees. Naturally decomposes to enrich soil with organic matter. Rich brown color enhances curb appeal and complements most landscaping designs.",
      "quantity": 100,
      "category": "garden tools"
    },
    {
      "id": "31",
      "name": "Grass Seed",
      "image": "https://via.placeholder.com/300x300?text=Grass+Seed",
      "price": 45.99,
      "description": "Premium grass seed blend for establishing thick, durable lawns in sun and partial shade conditions. This 20-pound bag covers up to 8,000 square feet with drought-resistant varieties. Quick germination in 7-14 days with proper watering and soil preparation. Perfect for new lawns, overseeding, and bare spot repair.",
      "quantity": 35,
      "category": "seeds"
    },
    {
      "id": "32",
      "name": "Hand Tools",
      "image": "https://via.placeholder.com/300x300?text=Hand+Tools",
      "price": 29.99,
      "description": "Complete hand tool set including hammer, screwdrivers, pliers, and measuring tape in convenient carrying case. These professional-grade tools feature comfortable grips and durable construction for years of reliable use. Perfect starter set for homeowners and apartment dwellers. Essential tools for basic repairs and maintenance projects.",
      "quantity": 50,
      "category": "wood working tools"
    },
    {
      "id": "33",
      "name": "Power Drill",
      "image": "https://via.placeholder.com/300x300?text=Power+Drill",
      "price": 79.99,
      "description": "Cordless power drill with variable speed trigger and keyless chuck for versatile drilling and driving applications. Includes rechargeable battery, charger, and basic drill bit set. Compact design with LED work light for improved visibility in dark spaces. Perfect for furniture assembly, picture hanging, and general home repairs.",
      "quantity": 30,
      "category": "wood working tools"
    },
    {
      "id": "34",
      "name": "Tomato Seeds",
      "image": "https://via.placeholder.com/300x300?text=Tomatoes",
      "price": 2.49,
      "description": "Premium heirloom tomato seeds perfect for home gardening enthusiasts. These non-GMO seeds produce flavorful, juicy tomatoes with exceptional taste and texture. Suitable for both container gardening and traditional garden beds. High germination rate with detailed planting instructions included. Harvest fresh, organic tomatoes all season long.",
      "quantity": 100,
      "category": "seeds"
    },
    {
      "id": "35",
      "name": "Onion Seeds",
      "image": "https://via.placeholder.com/300x300?text=Onions",
      "price": 2.29,
      "description": "Sweet onion seeds that are incredibly easy to grow in any garden setting. These varieties produce large, mild-flavored bulbs perfect for cooking and fresh eating. Long storage life when properly cured. Resistant to common onion diseases and adaptable to various soil conditions. Great for companion planting with tomatoes and peppers.",
      "quantity": 90,
      "category": "seeds"
    },
    {
      "id": "36",
      "name": "Mustard Greens Seeds",
      "image": "https://via.placeholder.com/300x300?text=Mustard+Greens",
      "price": 1.79,
      "description": "Zesty mustard greens seeds perfect for adding spicy flavor to salads and stir-fry dishes. These fast-growing leafy greens are packed with vitamins and nutrients. Can be harvested as baby greens or full-size leaves. Cold-hardy variety that extends your growing season. Excellent source of vitamins A, C, and K.",
      "quantity": 95,
      "category": "seeds"
    }
  ],
  "cart": []
}